"use strict";

function drawOmikuji() {
  const results = [
    "=================\n 第一番【🎉 大吉 🎉】\n\n 最高の一年になります\n 🎓学業：合格の兆しあり\n=================\n",
    "=================\n 第七番【🎉 大吉 🎉】\n\n 幸多き一年となります\n 🎓学業：本番に強し\n=================\n",
    "=================\n 第八番【🎉 大吉 🎉】\n\n 実り多き年となります\n 🎓学業：努力が報われる\n=================\n",
    "=================\n 第十五番【🐎 吉 🐎】\n\n 良い流れに乗れそうです\n 🎓学業：安心して励め\n=================\n",
    "=================\n 第二十番【😄 中吉 😄】\n\n 努力が実を結びます\n 🎓学業：自分を信じよ\n=================\n",
    "=================\n 第三十番【😊 小吉 😊】\n\n 小さな幸せに気づけそう\n 🎓学業：道は開ける\n=================\n",
    "=================\n 第五十番【😓 末吉 😓】\n\n これから運気が上向きます\n 🎓学業：今が踏ん張り時\n=================\n",
    "=================\n 第七十番【😭 凶 😭】\n\n 慎重に行動しましょう\n 🎓学業：見直し忘れるな\n=================\n",
  ];
  return results[Math.floor(Math.random() * results.length)];
}

module.exports = { drawOmikuji };

// 〇解説〇
// 【Math.random()】
// 0以上1未満のランダムな小数
// 例：0.12, 0.87, 0.003

// 【results.length】
// 配列の要素数
// results = ["大吉","大吉","大吉", "吉", "中吉", "小吉", "末吉", "凶"];
// ★lengthは8

// 【Math.random() * 6】
// 0以上6未満のランダムな小数
// 例：2.3, 5.9, 0.1

// 【Math.floor(...)】
// Math.floor(2.3) // → 2
// Math.floor(5.9) // → 5
// 小数を 切り捨てて整数にする
// 0, 1, 2, 3, 4, 5, 6, 7
// ★配列のインデックスにぴったりとなる

// results[4] // → "第二十番【😄 中吉 😄】"
// results[7] // → "第七十番【😭 凶 😭】"
